// 需求: 鸡兔同笼：鸡和兔子一共35只，笼子里一共有94只脚，用程序计算出鸡和兔子分别多少只


//步骤
//1.定义变量 a等于只数
var a=35
//2. 定义变量 b等于脚数
var b=94
//3.假设兔子抬起两条腿  那么每只动物都有两条腿  94除2等于47  47减去总数a  就是抬腿兔子的数量
numt=b/2-a
//4. 鸡的数量等于总数减去兔子的数量
numj=a-numt
console.log('鸡有'+numj+'只','兔子有'+numt+'只')



//  标准答案
var a1 = 2;
var b1 = 4;
for (var i = 0; i < 35; i++) {
    for (var j = 0; j < 35; j++) {
        if (i * a1 + j * b1 === 94 && (j + i) === 35) {
            console.log("鸡有" + i + "只");
            console.log("兔有" + j + "只");
        }
    }
}