/*5. 分析以下需求并实现
   1.定义一个用于存放班级分数的数组var score = [80,90,85,90,78,88,89,93,98,75];
   2.求出班级不及格人数(分数低于60分的就是不及格) ?? 
   3.求出班级的平均分
   4.求出班级的总分数*/
   //声明一个数组
   var score = [80, 90, 85, 90, 78, 88, 89, 93, 98, 75]
   //声明一个不及格人数变量
   var pop = 0
   //声明一个元素和的变量
   var sum = 0
   //声明一个平均分的变量
   var avg = 0
   //遍历数组
   for (var i = 0; i < score.length; i++) {
       //如果分数低于60则打印不及格
       if (score[i] < 60) {
           console.log("不及格")
       }
       //累加
       sum += score[i]
   }
   //求平均值
   avg = sum / score.length
   //打印总分与平均值
   console.log(sum, avg)