// 30.	 求200到300之间所有奇数的和
// var a=0
// for(i=200;i<=300;i++){
//     if(i%2==1){
//         a+=i
//     }
// }
// console.log(a)
// 31.	 for循环嵌套打印5行5列的正方形，如图所示(拔高题)
//  for(var i=1; i<=5; i++){
//     var x= '';
//     for(var a=1; a<=5; a++){
//       x += '*';
//     }
//     console.log(x);
//   }
// 32.	for循环嵌套打印一个直角三角形,如果所示(拔高题)
//  .
// 33.	for循环嵌套打印一个倒的直角三角形,如果所示(拔高题)
 
// 34.	企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可可提成7.5%；20万到40万之间时，高于20万元的部分，可提成5%；40万到60万之间时高于40万元的部分，可提成3%；60万到100万之间时，高于60万元的部分，可提成1.5%，高于100万元时，超过100万元的部分按1%提成，用户定义变量，输入当月利润I，求应发放奖金总数？
// var a = 1100000;
// var b = 0;
// if (a < 100000) {
//     b = a * 0.1
// } else if (a > 100000 && a < 200000) {
//     var num1 = a - 100000
//     b= 100000 * 0.1
//     b += num1 * 0.075
// } else if (a > 200000 && a < 400000) {
//     var num1 = a - 100000
//     var num2 = a - 100000
//     b = 100000 * 0.1
//     b += num1 * 0.075
//     b += num2 * 0.05
// } else if (a> 400000 && a < 600000) {
//     var num1 = a - 100000
//     var num2 = a - 100000
//     var num3 = a - 200000
//     b = 100000 * 0.1
//     b += num1 * 0.075
//     b += num2 * 0.05
//     b += num3 * 0.03
// } else if (a > 600000 && a < 1000000) {
//     var num1 = a - 100000
//     var num2 = a - 100000
//     var num3 = a - 200000
//     var num4 = a - 200000
//     b = 100000 * 0.1
//     b += num1 * 0.075
//     b += num2 * 0.05
//     b += num3 * 0.03
//     b += num4 * 0.015
// } else if (a > 1000000) {
//     var num1 = a - 100000
//     var num2 = a - 100000
//     var num3 = a - 200000
//     var num4 = a - 200000
//     var num5 = a - 400000

//     b = 100000 * 0.1
//     b += num1 * 0.075
//     b += num2 * 0.05
//     b += num3 * 0.03
//     b += num4 * 0.015
//     b += num5 * 0.01
// }
// console.log(b);

// 35.	找出1-99之间是7的倍数或者个位数字是7或者是十位数字是7的数字，在控制台打印输出
// for (var i=1;i<=99;i++){
//     var a=i%10;
//     if(i>10){
//         var b=i/10%10
//     }

//     if(i%7==0||a==7|b==7){
//         console.log(i);
//     }
// }
// 36.	利用JavaScript编写程序实现如下功能，五个小朋友排成一队。
// 问第一个多大了，第一个说比第二个大两岁，
//   问第二个，第二个说比第三个大两岁，以此类推。
//   问第五个小朋友几岁了，第五个小朋友说3岁了。
//   问第一个小朋友几岁了？
// 要求：控制台输出第一个小朋友的年龄是几岁
// var a = 3;
// for (i = 5; i > 0; i--) {
//     a = a + 2;
// }
// console.log("第一个小朋友" + a + "岁");
// 38.使用for循环语句计算3+6+9+12+……+99的结果
// var a=0
// for(i=3;i<=99;i++){
//     if(i%3==0){
//         a+=i
//     }
// }
// console.log(a)
// 39.输出1加到100（去掉3的倍数）的和
// var a=0
// for(i=1;i<=100;i++){
// if (i%3!==0){
//     a+=i
// }
// }
// console.log(a)
// 40.求1-100之间所有数的积
// var a=1
// for(i=2;i<=100;i++){
//     a*=i
// }console.log(a)
//数据过大   js数据出错
// 二、简答题
// 1. 转字符串类型的时候，有哪些限制？
// undefined和null  不能用toString的方法转换
// 2. 关于变量命名的规则有哪些
//只包含数字 字母和下划线   不能用数字开头
// 3. Console.log(true&&false||true)和console.log(false || true&&false)的结果分别是什么，并解释为什么
//Console.log(true&&false||true)  报错 c不能大写 
// console.log(false || true&&false)  &&优先级大于||  先比较&& 一假则假所以输出为false  || 一真则真  所以最后输出为flase
// 4. 将一行字符串分多行显示，有几种写法，分别是什么
//  三种  1.用反引号  2.用反斜线  3.用反引号然后用+号连接起来

